
class News {
  static const List<NSDATA> newsGet = [
    NSDATA(
      name:
          "В Европе впервые почти за 10 лет снижаются цены на жильё",
      description:
          "Цены на жильё снизились на 1,7% в еврозоне по сравнению с предыдущим годом и на 1,1% в целом по ЕС во втором квартале 2023 года, согласно данным Eurostat. Но \"передышка\" от повышения цен может оказаться недолгой.\n\nТенденция на европейском рынке недвижимости вот-вот изменится: жильё в среднем стоит дешевле, чем в прошлом году, но в квартальных цифрах наметился определённый сдвиг, намекающий на то, что снижение цен может продлиться недолго.\nСогласно последним данным агентства Eurostat, во втором квартале цены на жильё в Европе впервые с 2014 года снизились в годовом исчислении.\n\nИндекс цен в период с апреля по июнь снизился на 1,7% в еврозоне и на 1,1% в целом по ЕС по сравнению с тем же кварталом предыдущего года. Эти цифры следуют за годовым ростом на 0,4% и 0,8% в еврозоне и ЕС соответственно, зафиксированным в первые три месяца года.",
      image:
          "https://static.euronews.com/articles/stories/07/93/99/28/773x435_cmsv2_5e56e14f-0d7a-5b2a-83ce-2dc6f6615048-7939928.jpg",
    ),
    NSDATA(
      name:
          "Нобелевская премия по физике за исследование динамики электронов в веществе",
      description:
          "В своих экспериментах лауреаты этого года создали вспышки света, достаточно короткие для того, чтобы сделать моментальные снимки чрезвычайно быстрого движения электронов.\n\nПьер Агостини из Университета штата Огайо (США) и Ференц Крауз из Института квантовой оптики Макса Планка и Мюнхенского университета Людвига Максимилиана (Германия) продемонстрировали, что этот эффект может быть использован для создания более коротких импульсов света, чем это было возможно ранее.\nХанс Эллегрен, генеральный секретарь Шведской королевской академии наук, объявил о присуждении премии в Стокгольме.\nНобелевская премия включает в себя денежное вознаграждение в размере 11 млн. шведских крон (1 млн. долл.). Деньги поступают из завещания, оставленного создателем премии, шведским изобретателем Альфредом Нобелем, умершим в 1896 году.\nВ прошлом году трое ученых совместно получили премию по физике за доказательство того, что крошечные частицы могут сохранять связь друг с другом, даже будучи разделенными. В свое время это явление вызывало сомнения, но теперь оно изучается на предмет возможного применения в реальной жизни, например, для шифрования информации.",
      image:
          "https://pbs.twimg.com/media/F7gYMRiXMAAuJUc?format=jpg&name=large",
    ),
    NSDATA(
      name: "Еврозона: в сентябре инфляция упала до 4,3% в годовом исчислении (Евростат)",
      description:
          "Еврозона: в сентябре инфляция упала до 4,3% в годовом исчислении (Евростат)\n\nГодовой уровень инфляции в еврозоне упал до 4,3% в годовом исчислении в сентябре после 5,2% в августе, достигнув самого низкого уровня с октября 2021 года, сообщил Евростат в пятницу.\n\nЭтот показатель оказался лучше ожиданий аналитиков Factset, которые в среднем ожидали замедления темпов роста до 4,5%. Тем не менее, инфляция в 20 странах, использующих единую валюту, все еще остается значительно выше целевого показателя в 2%, установленного Европейским центральным банком (ЕЦБ).",
      image: "https://cdn.cfr.org/sites/default/files/styles/immersive_image_3_2_desktop_2x/public/image/2019/06/EUParliament.jpg.webp",
    ),
    NSDATA(
      name: "Португалия отменит налоговые льготы для иностранцев из-за жилищного кризиса",
      description:
          "В 2024 году Португалия отменит специальный налоговый режим, по которому проживающие в стране иностранцы платят налог по фиксированной ставке в 20%\n\nПравительство Португалии объявило о планах отмены \"налоговых льгот\" для иностранных резидентов, которые португальцы считают несправедливыми. Премьер-министр Антониу Кошта пообещал прекратить действие этой схемы в 2024 году, при этом она останется в силе для тех, кто уже ею пользуется.\n\nДо сих пор в течение 10 лет иностранцы, решившие переехать в Португалию, платили налог по фиксированной ставке в 20%, в то время как в стране действует прогрессивная ставка налогообложения, достигающая 48%. Эта концепция была введена в 2009 г., в условиях финансового кризиса, для привлечения инвесторов и специалистов, но также стала популярна среди европейских пенсионеров. В июле этого года министерство финансов Португалии сообщило, что этой схемой пользуются 89 000 иностранцев.\n\nОднако в конечном итоге приток состоятельных иностранцев спровоцировал стремительный рост цен на жилье, лишив многих граждан Португалии возможности оплачивать аренду. В связи с чем в стране прошла серия акций протеста с требованием к правительству принять меры.",
      image:
          "https://immigrantinvest.com/wp-content/uploads/2020/06/all-about-portugal-for-investors-302028867.jpeg",
    ),
    NSDATA(
      name:
          "Швейцарский суд оправдал белорусского спецназовца",
      description:
          "Швейцарский суд счёл показания бывшего бойца СОБР Юрия Гаравского по делу об исчезновении белорусских политиков в 1999 году путанными и не заслуживающими доверия\n\nСуд в Швейцарии оправдал бывшего сотрудника белорусского СОБРа Юрия Гаравского. Его обвиняли в причастности к похищению и убийству в 1999 году троих деятелей белорусской оппозиции: экс-главы Центризбиркома Виктора Гончара, экс-министра внутренних дел Юрия Захаренко и предпринимателя Анатолия Красовского.\n\nГаравский бежал в Швейцарию в 2018 году, тогда он и признался, что участвовал в похищении и расстреле, дав интервью СМИ. Но позже, уже в ходе процесса, менял показания и путался в деталях настолько, что против него были выдвинуты и обвинения во введении правосудия в заблуждение.\n\nНо в итоге по обеим статьям Гаравского оправдали. Судья заявил, что это «особый случай», в котором замешаны власти Беларуси, которые и несут несомненную ответственность. Что касается экс-бойца СОБРа, его роль в событиях четвертьвековой давности для суда осталась неясной.\n\nАдвокаты родственников погибших оппозиционеров подали также гражданский иск с требованием материальной компенсации. Это дело будет рассматриваться отдельно в гражданском суде.",
      image:
          "https://www.sport-interfax.ru/ftproot/photos/photostory/2016/08/31/s700.jpg",
    ),
    NSDATA(
      name:
          "В Великобритании впервые за 10 лет снижаются цены на жильё",
      description:
          "На рынке жилья Великобритании наблюдается первое снижение цен в годовом исчислении с 2012 года, несмотря на рост процентных ставок. Тем не менее потенциальное повышение налогов может удержать инвесторов от покупки.\nВ Великобритании всё труднее стать собственником жилья, но лопнул ли \"пузырь\" на рынке недвижимости?\n\nПо данным Nationwide Building Society, цены на жильё сейчас снижаются самыми быстрыми темпами с середины 2009 года, что обусловлено повышением ставок по ипотечным кредитам и продолжающимся снижением доступности жилья для потенциальных покупателей.\n\nВ месячном исчислении цены на жильё не изменились после падения на 0,8% в августе.\n\nСогласно исследованию, стоимость типичного дома снизилась до £257 808 (€297 575) по сравнению с £259 153 (€299 127) месяцем ранее.\n\nНынешнее падение цен – лишь один элемент сложного жилищного ландшафта, на который влияют различные экономические факторы и настроения потребителей.",
      image:
          "https://static.euronews.com/articles/stories/07/93/28/24/773x435_cmsv2_e2bc0fd3-a25f-552e-a51a-e73023b463bc-7932824.jpg",
    ),
  ];
}
class NSDATA {
  final String name;
  final String description;
  final String image;

  const NSDATA({
    required this.name,
    required this.description,
    required this.image,
  });
}
